In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import os
import re
import numpy as np
import math
from sklearn.tree import DecisionTreeClassifier, export_graphviz
from graphviz import Source
from IPython.display import SVG

In [2]:
class PathResolver:
    _relative_directory = '..'
    _source_directory = '{}/Src'.format(_relative_directory)
    _data_directory = '{}/Data'.format(_relative_directory)

    def GetDataFilepath(__self__, filename):
      return '{}/{}'.format(__self__._data_directory, filename)

    def GetSrcFilepath(__self__, filename):
      return '{}/{}'.format(__self__._source_directory, filename)

    def ReadDataFrameFromFilepath(__self__, filename):
      return pd.read_csv(__self__.GetDataFilepath(filename), sep=";")

In [3]:
path_resolver = PathResolver()

In [4]:
clients = path_resolver.ReadDataFrameFromFilepath('client.asc')
clients.head()

   client_id  birth_number  district_id
0          1        706213           18
1          2        450204            1
2          3        406009            1
3          4        561201            5
4          5        605703            5

In [5]:
class DateResolver:
    #Birthnumber is an abstraction that holds an encoded yymmdd in a specific format
    def resolve_gender_and_birthdate(__self__, date_number):
        [yy, mm, dd] = __self__._resolve_birthdate(date_number)
        
        return (__self__._resolve_gender_from_month(mm), __self__.get_date(yy, __self__._correct_month_if_necessary(mm), dd))
    
    def resolve_birthdate(__self__, date_number):
        [yy, mm, dd] = __self__._resolve_birthdate(date_number)
        
        return __self__.get_date(yy, __self__._correct_month_if_necessary(mm), dd)
    
    def _resolve_birthdate(__self__, date_number):
        pair_list = [int(x) for x in re.findall('\d{2}', str(date_number))]
        
        return [pair_list[0], pair_list[1], pair_list[2]]
        
    # If the month is larger than 50, then it is a woman (MM + 50)
    def _resolve_gender_from_month(__self__, mm):
        return 'Male' if mm < 50 else 'Female'
    
    def _correct_month_if_necessary(__self__, mm):
        return mm - 50 if mm >= 50 else mm
            
    def get_date(__self__, yy, mm, dd):
        return '19{}-{}-{}'.format(yy, mm, dd)

In [6]:
date_resolver = DateResolver()
genders_and_birth_dates = clients.birth_number.apply(date_resolver.resolve_gender_and_birthdate)
clients['gender'] = [gender for (gender, _) in genders_and_birth_dates]
clients['birth_date'] = [birth_date for (_, birth_date) in genders_and_birth_dates]
clients.birth_date = clients.birth_date.apply(pd.to_datetime)
clients.head()

   client_id  birth_number  district_id  gender birth_date
0          1        706213           18  Female 1970-12-13
1          2        450204            1    Male 1945-02-04
2          3        406009            1  Female 1940-10-09
3          4        561201            5    Male 1956-12-01
4          5        605703            5  Female 1960-07-03

In [7]:
disposition = path_resolver.ReadDataFrameFromFilepath('disp.asc')
disposition.head()

   disp_id  client_id  account_id       type
0        1          1           1      OWNER
1        2          2           2      OWNER
2        3          3           2  DISPONENT
3        4          4           3      OWNER
4        5          5           3  DISPONENT

In [8]:
districts = path_resolver.ReadDataFrameFromFilepath('district.asc')
districts.head()

,A1,A2,A3,A4,A5,A6,A7,A8,A9,A10,A11,A12,A13,A14,A15,A16
0,1,Hl.m. Praha,Prague,1204953,0,0,0,1,1,100.0,12541,0.29,0.43,167,85677,99107
1,2,Benesov,central Bohemia,88884,80,26,6,2,5,46.7,8507,1.67,1.85,132,2159,2674
2,3,Beroun,central Bohemia,75232,55,26,4,1,5,41.7,8980,1.95,2.21,111,2824,2813
3,4,Kladno,central Bohemia,149893,63,29,6,2,6,67.4,9753,4.64,5.05,109,5244,5892
4,5,Kolin,central Bohemia,95616,65,30,4,1,6,51.4,9307,3.85,4.43,118,2616,3040

In [9]:
districts.columns = ['district_id','district_name','region',"n_inhabitants",
                    "municip_less_499","municip_between_500_1999","municip_between_2000_9999",
                    "municip_more_10000", "n_cities","ratio_urban_inhab","avg_salary","unemploy_rate_95",
                    "unemploy_rate_96","n_entrepreneurs_1000_inhab","n_commited_crimes_95","n_commited_crimes_96"]
districts.head()

,district_id,district_name,region,n_inhabitants,municip_less_499,municip_between_500_1999,municip_between_2000_9999,municip_more_10000,n_cities,ratio_urban_inhab,avg_salary,unemploy_rate_95,unemploy_rate_96,n_entrepreneurs_1000_inhab,n_commited_crimes_95,n_commited_crimes_96
0,1,Hl.m. Praha,Prague,1204953,0,0,0,1,1,100.0,12541,0.29,0.43,167,85677,99107
1,2,Benesov,central Bohemia,88884,80,26,6,2,5,46.7,8507,1.67,1.85,132,2159,2674
2,3,Beroun,central Bohemia,75232,55,26,4,1,5,41.7,8980,1.95,2.21,111,2824,2813
3,4,Kladno,central Bohemia,149893,63,29,6,2,6,67.4,9753,4.64,5.05,109,5244,5892
4,5,Kolin,central Bohemia,95616,65,30,4,1,6,51.4,9307,3.85,4.43,118,2616,3040

In [10]:
clients_dispositions = pd.merge(clients, disposition, on = 'client_id')
clients_dispositions.head()

,client_id,birth_number,district_id,gender,birth_date,disp_id,account_id,type
0,1,706213,18,Female,1970-12-13,1,1,OWNER
1,2,450204,1,Male,1945-02-04,2,2,OWNER
2,3,406009,1,Female,1940-10-09,3,2,DISPONENT
3,4,561201,5,Male,1956-12-01,4,3,OWNER
4,5,605703,5,Female,1960-07-03,5,3,DISPONENT

In [11]:
credit_cards = path_resolver.ReadDataFrameFromFilepath('card.asc')
credit_cards.issued = pd.to_datetime(credit_cards.issued.apply(date_resolver.resolve_birthdate))
credit_cards.head()

   card_id  disp_id     type     issued
0     1005     9285  classic 1993-11-07
1      104      588  classic 1994-01-19
2      747     4915  classic 1994-02-05
3       70      439  classic 1994-02-08
4      577     3687  classic 1994-02-15

In [12]:
class CzechTranslator:    
    _cz_to_en_dict = {
        'POPLATEK MESICNE': 'monthly', 'POPLATEK TYDNE': 'weekly', 'POPLATEK PO OBRATU': 'after_transaction',
        'PRIJEM': 'credit', 'VYDAJ': 'debit', 'VYBER': 'choice',
        'VYBER KARTOU': 'card_debit', 'VKLAD': 'cash_credit', 'VYBER': 'cash_debit', 
        'PREVOD Z UCTU': 'other_bank_credit', 'PREVOD NA UCET': 'other_bank_debit',
        'POJISTNE': 'insurance', 'SIPO': 'household', 'LEASING': 'leasing', 'UVER': 'loan',
        'DUCHOD': 'pension', 'SLUZBY': 'statement_for_payment', 'SANKC. UROK': 'sanction_negative_balance', 'UROK': 'interest_credit'
    }
    
    def translate_if_possible(__self__, word):
        if type(word) != str:
            return ''
        
        uppercase_word = str.upper(word)
        
        return __self__._cz_to_en_dict[uppercase_word] if __self__._cz_to_en_dict.get(uppercase_word) != None else word
            
czech_to_en = CzechTranslator()

In [13]:
# Translates czech words
orders = path_resolver.ReadDataFrameFromFilepath('order.asc')
orders.k_symbol = orders.k_symbol.apply(czech_to_en.translate_if_possible)
orders.head()

   order_id  account_id bank_to  account_to  amount   k_symbol
0     29401           1      YZ    87144583  2452.0  household
1     29402           2      ST    89597016  3372.7       loan
2     29403           2      QR    13943797  7266.0  household
3     29404           3      WX    83084338  1135.0  household
4     29405           3      CD    24485939   327.0

In [14]:
# Translates A, B, C and D to human readable fields
loans_status_lookup = {'A': 'finished_ok', 'B': 'finished_with_default', 'C': 'running_ok', 'D': 'running_in_debt'}
loans = path_resolver.ReadDataFrameFromFilepath('loan.asc')
loans.date = pd.to_datetime(loans.date.apply(date_resolver.resolve_birthdate))
loans.status = [loans_status_lookup[status] for status in loans.status]
loans.head()

,loan_id,account_id,date,amount,duration,payments,status
0,5314,1787,1993-07-05,96396,12,8033.0,finished_with_default
1,5316,1801,1993-07-11,165960,36,4610.0,finished_ok
2,6863,9188,1993-07-28,127080,60,2118.0,finished_ok
3,5325,1843,1993-08-03,105804,36,2939.0,finished_ok
4,7240,11013,1993-09-06,274740,60,4579.0,finished_ok

In [15]:
accounts = path_resolver.ReadDataFrameFromFilepath('account.asc')
accounts.date = pd.to_datetime(accounts.date.apply(date_resolver.resolve_birthdate))
accounts.frequency = accounts.frequency.apply(czech_to_en.translate_if_possible)
print(accounts.frequency.value_counts())
accounts.head()

monthly              4167
weekly                240
after_transaction      93
Name: frequency, dtype: int64

   account_id  district_id frequency       date
0         576           55   monthly 1993-01-01
1        3818           74   monthly 1993-01-01
2         704           55   monthly 1993-01-01
3        2378           16   monthly 1993-01-01
4        2632           24   monthly 1993-01-02

In [16]:
transactions = pd.read_csv(path_resolver.GetDataFilepath('trans.asc'), sep=";", dtype = {'operation': str})
transactions.date = pd.to_datetime(transactions.date.apply(date_resolver.resolve_birthdate))
transactions.type = transactions.type.apply(czech_to_en.translate_if_possible)
print(transactions.type.value_counts())
print("==============================")
transactions.operation = transactions.operation.apply(czech_to_en.translate_if_possible)
print(transactions.operation.value_counts())
transactions.head()

/usr/lib/python3/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (8) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

debit         634571
credit        405083
cash_debit     16666
Name: type, dtype: int64
==============================
cash_debit           434918
other_bank_debit     208283
                     183114
cash_credit          156743
other_bank_credit     65226
card_debit             8036
Name: operation, dtype: int64

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,695247,2378,1993-01-01,credit,cash_credit,700.0,700.0,NaN,NaN,NaN
1,171812,576,1993-01-01,credit,cash_credit,900.0,900.0,NaN,NaN,NaN
2,207264,704,1993-01-01,credit,cash_credit,1000.0,1000.0,NaN,NaN,NaN
3,1117247,3818,1993-01-01,credit,cash_credit,600.0,600.0,NaN,NaN,NaN
4,579373,1972,1993-01-02,credit,cash_credit,400.0,400.0,NaN,NaN,NaN

In [17]:
clients_districts = pd.merge(clients_dispositions, districts, on = 'district_id')
clients_districts.head()

NameError: name 'colnames' is not defined

In [ ]:
accounts_districts = pd.merge(accounts, districts, on = 'district_id')
accounts_districts.head()

In [ ]:
clients_accounts = pd.merge(clients_dispositions, accounts, on = 'account_id', suffixes = ('_client', '_account'))
clients_accounts.head()

In [ ]:
clients_districts_cards = pd.merge(clients_districts, credit_cards, on = 'disp_id', suffixes=('_client', '_card'))
clients_districts_cards.head()

In [ ]:
clients_accounts_loans = pd.merge(clients_accounts, loans, on = 'account_id', suffixes = ('_client', '_loan'))
clients_accounts_loans.head()

In [ ]:
# GetScoreForFactorVariables <- function(data, discript, strings)
# {
#   values <- data[, discript]
#   scores <- 1:length(strings)
#   names(scores) <- strings
#   data$scores <- scores[values]
  
#   return (data$scores)
# }

# GetScoreForNumericVariables <- function(data, posneg)
# {
#   values <- as.double(unlist(data))
#   score <- as.integer(NA)
#   data <- data.frame(values, score)
  
#   posneg = "p"
#   range1 <- between(data$values,quantile(data$values, na.rm = T)[1],quantile(data$values, na.rm = T)[2])
#   range2 <- between(data$values,quantile(data$values, na.rm = T)[2],quantile(data$values, na.rm = T)[3])
#   range3 <- between(data$values,quantile(data$values, na.rm = T)[3],quantile(data$values, na.rm = T)[4])
#   range4 <- between(data$values,quantile(data$values, na.rm = T)[4],quantile(data$values, na.rm = T)[5])
  
#   if(posneg == "p")
#   {
#     data$score <- ifelse(range1 == TRUE, 1,ifelse(range2 == TRUE, 2,ifelse(range3 == TRUE, 3, ifelse(range4 == TRUE, 4, NA))))
    
#     return(data$score)
    
#   }else if(posneg == "n")
#   {
    #data$score <- ifelse(range1 == TRUE, 4,ifelse(range2 == TRUE, 3,ifelse(range3 == TRUE, 2, ifelse(range4 == TRUE, 1, NA))))
    
#    return(data$score)
#  }else
#  {
#    print("Insira p ou n para obter o score desejado.")  
#  }      
#}  

#ConvertCharAndIntegerVariables <- function(data){
#  data[sapply(data, is.integer)] <- lapply(data[sapply(data, is.integer)], as.numeric)
#  data[sapply(data, is.character)] <- lapply(data[sapply(data, is.character)], as.factor) 
  
#  return(sapply(data, class))
#}

#Original R code to be rewritten
#clientrating.df <- clientsdisp.df[c(1,4,6,8)]
#clientrating.df$cl_district_id <- joinclientaccount$cl_district_id
#clientrating.df$acnt_district_id <- joinclientaccount$acnt_district_id
#clientrating.df$diff_district <- ifelse(clientrating.df$cl_district_id != clientrating.df$acnt_district_id, 1, 0)

#client district
#clientrating.df$dis_avg_salary <- GetScoreForNumericVariables(joinclientdistrict$avg_salary,"p")
#clientrating.df$dis_unemp_rate_95 <- GetScoreForNumericVariables(joinclientdistrict$unemploy_rate_95,"n")
#clientrating.df$dis_unemp_rate_96 <- GetScoreForNumericVariables(joinclientdistrict$unemploy_rate_96,"n")
#clientrating.df$dis_commit_crimes_95 <- GetScoreForNumericVariables(joinclientdistrict$n_commited_crimes_95,"n")
#clientrating.df$dis_commit_crimes_96 <- GetScoreForNumericVariables(joinclientdistrict$n_commited_crimes_96,"n")


# client type - Owner - 2, DISPONENT - 1
#clientrating.df$client_type <- as.numeric(revalue(joinclientdistrict$type_cl,replace = c("OWNER" = 2, "DISPONENT" = 1)))

# Card score - Gold - 3, Classic - 2, Junior - 1
#clientrating.df$card <- as.numeric(revalue(joinclientcard$type_card,replace = c("gold" = 3, "classic" = 2, "junior" = 1)))

# Years that the client has the card
#clientrating.df$year_card <- GetScoreForNumericVariables(GetAgeFromRefDate(joinclientcard$issued,refdate),"p")

# Account frequency
#clientrating.df$acnt_frequency <- GetScoreForFactorVariables(joinclientaccount, "frequency", c("Monthly", "Weekly", "AfterTransaction"))

# Years that the client has the account
#clientrating.df$year_account <- GetScoreForNumericVariables(GetAgeFromRefDate(joinclientaccount$date,refdate))

# Loans
#clientrating.df$loan_status <- GetScoreForFactorVariables(joinclientacntloans, "status", c("ContractFinishedDefault", "RunningInDebt", "RunningOk","ContractFinishedOk"))

#clientrating.df$year_loan <- GetAgeFromRefDate(joinclientacntloans$date_loan,refdate) 
#clientrating.df$duration_loan <- joinclientacntloans$duration           
#year_loan <- clientrating.df$year_loan * 12
#duration <- joinclientacntloans$duration
#clientrating.df$mth_to_pay_loan <- ifelse(year_loan < duration, duration - year_loan,0)


# sum score
#clientrating.df$sum_score <- rowSums(clientrating.df[,7:18], na.rm = TRUE) 

#colnames(clientrating.df)

In [ ]:
# Still not using python processed data
arquivo = pd.read_csv("banco.csv", sep = ";")

arquivo.fillna(0, inplace = True)

y = arquivo["sum_scoreD"]
X = arquivo[["gender", "age", "dis_avg_salary", "dis_unemp_rate_95", "dis_unemp_rate_96",
        "dis_commit_crimes_95", "dis_commit_crimes_96", "client_type", "card", "year_card", "acnt_frequency", 
        "year_account", "loan_status"]]

dt = DecisionTreeClassifier(min_samples_split=1000, random_state=99)
dt.fit(X, y)

graph2 = Source(export_graphviz(dt, out_file=None
   , feature_names=["gender", "age", "dis_avg_salary", "dis_unemp_rate_95", "dis_unemp_rate_96",
        "dis_commit_crimes_95", "dis_commit_crimes_96", "client_type", "card", "year_card", "acnt_frequency", 
        "year_account", "loan_status"], class_names=['Good', 'Average', 'Ok', 'Bad'] 
   , filled = True))

display(SVG(graph2.pipe(format='svg')))